index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-19 Sun 23:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><a href="https://courses.packtpub.com/courses/take/the-applied-sql-data-analytics-workshop/">SQL Data Analytics Workshop</a></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title"><a href="https://courses.packtpub.com/courses/take/the-applied-sql-data-analytics-workshop/">SQL Data Analytics Workshop</a></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org58972d0">1. Setup</a>
<ul>
<li><a href="#org8c88df2">1.1. Start postgres database  from OS; Mine is windows</a></li>
<li><a href="#org681a413">1.2. Create the database  by logging in as super user</a></li>
</ul>
</li>
<li><a href="#orgc2c3138">2. Introduction</a></li>
<li><a href="#org997e719">3. Data Preparation</a></li>
<li><a href="#org0e8b908">4. Aggregate and Window Functions</a></li>
<li><a href="#org04155f0">5. Importing and Exporting Data</a>
<ul>
<li><a href="#org7987a03">5.1. Serverside</a></li>
<li><a href="#org9c0d9e1">5.2. Client Side</a></li>
<li><a href="#org93befb5">5.3. Excel dumping</a></li>
<li><a href="#org46d1578">5.4. Using R with such dumps</a></li>
<li><a href="#org0bf949b">5.5. Using Python</a></li>
</ul>
</li>
<li><a href="#orgd4c926b">6. Analytics Using Complex Data Types</a>
<ul>
<li><a href="#org9059e41">6.1. Arrays</a></li>
<li><a href="#org5995a89">6.2. Date and Time</a></li>
<li><a href="#org119ffb5">6.3. Geospatial</a></li>
<li><a href="#org60836ac">6.4. JSON/JSONB</a></li>
</ul>
</li>
<li><a href="#org03dfb76">7. Assesment</a>
<ul>
<li><a href="#org423cc65">7.1. Text Analytics</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
SQL Analytics in Postgres
</p>

<p>
This is course notes of the workshop written in org-mode.  Org-mode had good support for connecting to postgres and executed the src blocks and printed the results inline.
</p>
<div id="outline-container-org58972d0" class="outline-2">
<h2 id="org58972d0"><span class="section-number-2">1</span> Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
Get the data from git
</p>

<p>
<a href="https://github.com/PacktWorkshops/The-Applied-SQL-Data-Analytics-Workshop">https://github.com/PacktWorkshops/The-Applied-SQL-Data-Analytics-Workshop</a>
</p>
</div>

<div id="outline-container-org8c88df2" class="outline-3">
<h3 id="org8c88df2"><span class="section-number-3">1.1</span> Start postgres database  from OS; Mine is windows</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell">pg_ctl start
</pre>
</div>
</div>
</div>

<div id="outline-container-org681a413" class="outline-3">
<h3 id="org681a413"><span class="section-number-3">1.2</span> Create the database  by logging in as super user</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sql">select pg_terminate_backend(pid) from pg_stat_activity where datname='sqlda';
drop database IF EXISTS sqlda;
drop user IF EXISTS sqldaadmin;
create user sqldaadmin  password 'sqldaadmin';
ALTER USER sqldaadmin WITH SUPERUSER;
create database sqlda owner sqldaadmin;
</pre>
</div>

<p>
Now insert the data
</p>

<div class="org-src-container">
<pre class="src src-sql">\i Datasets/data.dump;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">\dt
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">SELECT * from sales LIMIT 10;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc2c3138" class="outline-2">
<h2 id="orgc2c3138"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sql">SELECT model
FROM products
ORDER BY production_start_date
LIMIT 5;
</pre>
</div>

<p>
If we are only interested in products that are not being produced, we can use the IS NOT NULL clause, as shown in the following query:
</p>

<div class="org-src-container">
<pre class="src src-sql">SELECT *
FROM products
WHERE production_end_date IS NOT NULL;
</pre>
</div>
</div>
</div>
<div id="outline-container-org997e719" class="outline-2">
<h2 id="org997e719"><span class="section-number-2">3</span> Data Preparation</h2>
</div>
<div id="outline-container-org0e8b908" class="outline-2">
<h2 id="org0e8b908"><span class="section-number-2">4</span> Aggregate and Window Functions</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sql">SELECT customer_id, title, first_name, last_name, gender,
COUNT(*) OVER () as total_customers
FROM customers
ORDER BY customer_id;

SELECT customer_id, title, first_name, last_name, gender,
COUNT(*) OVER (PARTITION BY gender) as total_customers
FROM customers
ORDER BY customer_id;

</pre>
</div>
</div>
</div>

<div id="outline-container-org04155f0" class="outline-2">
<h2 id="org04155f0"><span class="section-number-2">5</span> Importing and Exporting Data</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7987a03" class="outline-3">
<h3 id="org7987a03"><span class="section-number-3">5.1</span> Serverside</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sql">COPY (SELECT * FROM customers LIMIT 5) TO STDOUT WITH CSV HEADER DELIMITER '|';
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c0d9e1" class="outline-3">
<h3 id="org9c0d9e1"><span class="section-number-3">5.2</span> Client Side</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-sql">\copy customers TO 'my_file.csv' WITH CSV HEADER DELIMITER '|' NULL '' ;
\copy (SELECT * FROM cities) TO 'cities.csv’ WITH CSV HEADER DELIMITER ',';
</pre>
</div>
</div>
</div>
<div id="outline-container-org93befb5" class="outline-3">
<h3 id="org93befb5"><span class="section-number-3">5.3</span> Excel dumping</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>Dump CSV  by using <code>COPY</code> or <code>\copy</code></li>
<li>select the data in excel and go to insert to create a chart</li>
</ol>
</div>
</div>
<div id="outline-container-org46d1578" class="outline-3">
<h3 id="org46d1578"><span class="section-number-3">5.4</span> Using R with such dumps</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-R">library(RPostgreSQL)
con &lt;- dbConnect(PostgreSQL(), host="my_host", user="my_username", password="my password", dbname="zoomzoom", port=5432)
result &lt;- dbGetQuery(con, "select * from customers limit 10;")
result
</pre>
</div>
</div>
</div>
<div id="outline-container-org0bf949b" class="outline-3">
<h3 id="org0bf949b"><span class="section-number-3">5.5</span> Using Python</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-python">import psycopg2
with psycopg2.connect(host="my_host", user="my_username", password="my_password", dbname="zoomzoom", port=5432) as conn:
  with conn.cursor() as cur:
    cur.execute("SELECT * FROM customers LIMIT 5")
    records = cur.fetchall()
records
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd4c926b" class="outline-2">
<h2 id="orgd4c926b"><span class="section-number-2">6</span> Analytics Using Complex Data Types</h2>
<div class="outline-text-2" id="text-6">
<p>
Dates, Arrays, JSONB, TextAnalytics, Geospatial etc.
</p>
</div>
<div id="outline-container-org9059e41" class="outline-3">
<h3 id="org9059e41"><span class="section-number-3">6.1</span> Arrays</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-sql">--  SELECT ARRAY['Lemon', 'Bat Limited Edition'] AS example_purchased_products;
-- SELECT product_type, ARRAY_AGG(DISTINCT model) AS models FROM products GROUP BY 1;
-- SELECT product_type, ARRAY_AGG(model ORDER BY year) AS models FROM products GROUP BY 1;
-- SELECT UNNEST(ARRAY[123, 456, 789]) AS example_ids;
-- SELECT STRING_TO_ARRAY('hello there how are you?', ' ');
SELECT ARRAY_TO_STRING(ARRAY['Lemon', 'Bat Limited Edition'], ', ')  AS example_purchased_products;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5995a89" class="outline-3">
<h3 id="org5995a89"><span class="section-number-3">6.2</span> Date and Time</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Configure datetime formats
</p>
<div class="org-src-container">
<pre class="src src-sql">SHOW datestyle;
SELECT '1/8/1999'::DATE;
SELECT '1-8-1999'::DATE;
SELECT current_date;
SELECT now() AT TIME ZONE 'EST';
SELECT now();
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">              SELECT 
                current_date,
                EXTRACT(year FROM current_date) AS year,
                EXTRACT(month FROM current_date) AS month,
                EXTRACT(day FROM current_date) AS day,
                EXTRACT(dow FROM current_date) AS day_of_week,
                EXTRACT(week FROM current_date) AS week_of_year,
                EXTRACT(quarter FROM current_date) AS quarter;

            SELECT NOW(), DATE_TRUNC('month', NOW());

          SELECT DATE_TRUNC('quarter', NOW()) AS quarter,
                 SUM(sales_amount) AS total_quarterly_sales
            FROM sales
           GROUP BY 1
           ORDER BY 1 DESC;

        SELECT INTERVAL '5 days';

      SELECT TIMESTAMP '2016-03-01 00:00:00' - TIMESTAMP '2016-02-01 00:00:00' AS days_in_feb;
      SELECT TIMESTAMP '2016-03-01 00:00:00' + INTERVAL '7 days' AS new_date;
    SELECT DATE '2016-03-01' + 7 AS new_date;
  SELECT DATE '2016-03-01' - DATE '2016-02-01' AS days_in_feb;

 SELECT
    DATE_TRUNC('month', sales_transaction_date)  AS month_date,
    COUNT(1) AS number_of_sales
FROM sales
WHERE EXTRACT(year FROM sales_transaction_date) = 2018
GROUP BY 1
ORDER BY 1;

SELECT
  DATE_TRUNC('month', date_added)  AS month_date,
  COUNT(1) AS number_of_new_customers
FROM customers
WHERE EXTRACT(year FROM date_added) = 2018
GROUP BY 1
ORDER BY 1;
</pre>
</div>
</div>
</div>

<div id="outline-container-org119ffb5" class="outline-3">
<h3 id="org119ffb5"><span class="section-number-3">6.3</span> Geospatial</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-sql">CREATE EXTENSION cube;
CREATE EXTENSION earthdistance;

SELECT
    point(longitude, latitude)
FROM customers
LIMIT 10;

–  The earthdistance module also allows us to calculate the distance between points in miles:
SELECT
    point(-90, 38) &lt;@&gt; point(-91, 37) AS distance_in_miles;

</pre>
</div>
</div>
</div>
<div id="outline-container-org60836ac" class="outline-3">
<h3 id="org60836ac"><span class="section-number-3">6.4</span> JSON/JSONB</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-sql">SELECT row_to_json(c) FROM customers c limit 1;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">SELECT
  '{
  "a": 1,
  "b": 2,
  "c": 3
  }'::JSON -&gt; 'b' AS data;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">SELECT
  '{
  "a": 1,
  "b": [
  {"d": 4},
  {"d": 6},
  {"d": 4}
  ],
  "c": 3
  }'::JSON #&gt; ARRAY['b', '1', 'd'] AS data;
SELECT * FROM customer_sales WHERE customer_json @&gt; '{"customer_id":20}'::JSONB;

SELECT * FROM customer_sales WHERE customer_json @&gt; '{"customer_id":20}'::JSONB;

SELECT
  jsonb_path_exists(customer_json, '$.sales[0]')
FROM customer_sales
 LIMIT 3;  SELECT
             feedback,
             to_tsvector('english', feedback) AS tsvectorized_feedback
             FROM customer_survey
            LIMIT 1;
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org03dfb76" class="outline-2">
<h2 id="org03dfb76"><span class="section-number-2">7</span> Assesment</h2>
<div class="outline-text-2" id="text-7">
<p>
A user has a table “EmployeeData” in the SQL database. The user wants to delete the top 10 records form the EmployeeData table. Which SQL statement should the user use?
Not postgres may be
</p>
<div class="org-src-container">
<pre class="src src-sql">DELETE  TOP (100) FROM employee;
</pre>
</div>



<div class="org-src-container">
<pre class="src src-sql">SELECT NULLIF (’A’, ’B’); – returns ’A’
</pre>
</div>
</div>
<div id="outline-container-org423cc65" class="outline-3">
<h3 id="org423cc65"><span class="section-number-3">7.1</span> Text Analytics</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-sql">SELECT
    feedback,
    to_tsvector('english', feedback) AS tsvectorized_feedback
FROM customer_survey
LIMIT 1;

</pre>
</div>


<p>
Which statement is used to create a new table and insert data returned by a query?
</p>
<div class="org-src-container">
<pre class="src src-sql">SELCT INTO
</pre>
</div>
<p>
Which of the following functions is used to calculate ages between two timestamps and return a “symbolic” result that uses years and months?
AGE()
Which keyword refers to the last record in window function query using the window frame clause?
UNBOUNDED FOLLOWING
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-07-19 Sun 23:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>